/**
 * 设计模式的例子
 * 如果要新增设计模式例子，可以在对应的模式包名后增加编号
 * 例如：已有builder设计模式包，如果需要再次举例就增加builder1包
 * Created by yitao on 2019/1/10.
 */
package com.simile.plan.design.pattern;
//构建类型的设计模式，目前有5种，工厂方法模式，抽象工厂模式，单例模式，建造者模式，原型模式
/*
单例模式  singleton pattern
系统中唯一构建
 */
/*
原型模式  prototype pattern
更加高效的复制对象
 */
/*
构造器模式（建造者模式）  builder pattern
当构建的目的明确，但是不清楚构建的材料或者构建顺序的时候，可以使用该种模式
 */
/*
工厂模式  factory pattern
当构建的时候，清楚构建的材料和目的，可以使用该种模式
 */


//结构型模式，目前有7种，适配器模式，装饰器模式，代理模式，外观模式，桥接模式，组合模式，享元模式。
/*
适配器模式 adapter pattern
对不同的原材料（输出）和要求的材料（输入）进行转化
比如说A只能提供木头，B需要的是木板
 */

/*
代理模式  proxy pattern
 */


//行为型模式，目前有11种，策略模式，模板方法模式，观察者模式，迭代子模式，责任链模式，命令模式，备忘录模式，状态模式，访问者模式，中介者模式，解释器模式。


